{"<s>":0,"</s>":1,"<mask>":2,"<pad>":3,"<unk>":4,"#":5,"*":6,"+":7,"-":8,"/":9,"0":10,"1":11,"2":12,"3":13,"4":14,"5":15,"6":16,"7":17,"8":18,"=":19,"B":20,"K":21,"N":22,"O":23,"Q":24,"R":25,"a":26,"b":27,"c":28,"d":29,"e":30,"f":31,"g":32,"h":33,"x":34,"xd":35,"xe":36,"xf":37,"Nf":38,"xc":39,"Nc":40,"e4":41,"e5":42,"d4":43,"g5":44,"d5":45,"g4":46,"xb":47,"Kf":48,"d6":49,"c4":50,"Be":51,"d3":52,"xd5":53,"Re":54,"Bb":55,"g6":56,"c5":57,"xd4":58,"Nf3":59,"xe5":60,"d7":61,"Ra":62,"Rf":63,"g3":64,"d2":65,"xa":66,"Nf6":67,"xh":68,"Ke":69,"Kh":70,"Nc6":71,"Qf":72,"Qe":73,"Nc3":74,"xe4":75,"Bf":76,"c3":77,"c6":78,"b5":79,"g7":80,"h5":81,"b4":82,"h4":83,"h6":84,"Bxf":85,"h3":86,"a5":87,"b6":88,"a4":89,"a6":90,"Ne":91,"g2":92,"b3":93,"d8":94,"d1":95,"Rc":96,"xc6":97,"a3":98,"Rb":99,"xc3":100,"e6":101,"Bc4":102,"Qxf":103,"xc4":104,"f4":105,"Qc":106,"g8":107,"Nxf":108,"Rh":109,"xc5":110,"Rxf":111,"f5":112,"xg5":113,"xe6":114,"Re1":115,"g1":116,"Kc":117,"Qxd":118,"f6":119,"Bg5":120,"Be7":121,"xg4":122,"Rxd":123,"exd5":124,"Nxe5":125,"xb5":126,"Ne5":127,"Bd3":128,"Be3":129,"Kb":130,"f3":131,"Bc5":132,"Bg4":133,"Re8":134,"Bb5":135,"Ne4":136,"Nd5":137,"xb4":138,"Rxa":139,"Nxd4":140,"e3":141,"Bxd":142,"xe3":143,"Nb":144,"Bf4":145,"Nd4":146,"dxe5":147,"Nxe4":148,"gxf":149,"Bd6":150,"exf":151,"Be2":152,"Be6":153,"Bb4":154,"cxd4":155,"xe7":156,"Bd7":157,"Qf3":158,"Qe2":159,"Qxa":160,"Qxh":161,"Nxd5":162,"Qe7":163,"exd4":164,"xg6":165,"Nxd":166,"Ke7":167,"Bf5":168,"Kg7":169,"Ng5":170,"Rd1":171,"Kf7":172,"Rd8":173,"Bd2":174,"Kg2":175,"Bg7":176,"Ke2":177,"Qxb":178,"Rxh":179,"Qf6":180,"Kxf":181,"Kf2":182,"Nd7":183,"xg3":184,"Rxb":185,"Ne7":186,"cxd5":187,"Bxh":188,"xe2":189,"Nd2":190,"Qd2":191,"Bxf6":192,"Kd7":193,"Rc8":194,"Bb7":195,"e1":196,"Qd7":197,"xg7":198,"Rb8":199,"Bxf3":200,"Qb":201,"dxe4":202,"Kf6":203,"Bxa":204,"Ng4":205,"Qh5":206,"xc2":207,"xc7":208,"Rc1":209,"Kf3":210,"Kf8":211,"Ne2":212,"Kf1":213,"Bc":214,"Rb1":215,"Bxc6":216,"Ke3":217,"Nf5":218,"Kd2":219,"Ke6":220,"Kg3":221,"Qxd5":222,"e8":223,"Qd3":224,"Kg6":225,"Kh1":226,"Qxd4":227,"Qc7":228,"Qb6":229,"xg2":230,"Kh8":231,"Rf8":232,"Kh2":233,"Nf4":234,"Bxc3":235,"Rf1":236,"Qd6":237,"Nc5":238,"Kd6":239,"Bb3":240,"Qg4":241,"Rxe":242,"Kh7":243,"Kd3":244,"Nc4":245,"Kf5":246,"Bxe5":247,"Qg5":248,"Kf4":249,"Qh4":250,"Kg8":251,"Nxa":252,"Qc2":253,"Rg8":254,"Qa5":255,"Qe3":256,"gxh":257,"Bxd5":258,"Bxb":259,"Nb5":260,"Qb3":261,"Ke4":262,"Ke5":263,"a2":264,"Bb2":265,"bxc6":266,"Kg1":267,"Nxh":268,"Nb4":269,"a7":270,"Kxd":271,"Rg1":272,"Rd7":273,"Kg4":274,"Kg5":275,"Qd5":276,"Qg3":277,"Ng":278,"Qe6":279,"Rd2":280,"Kc7":281,"Qxe5":282,"Qd4":283,"fxe5":284,"bxc3":285,"Kc6":286,"Bg2":287,"Re2":288,"Qxf3":289,"Qe5":290,"Qf4":291,"Bxe4":292,"Bxd4":293,"Kd4":294,"Kd5":295,"Qh":296,"Qe4":297,"Qa4":298,"Re7":299,"Kc2":300,"Qf5":301,"Bd5":302,"Qg6":303,"Kc3":304,"dxc4":305,"Kd8":306,"Qxf6":307,"Qxe4":308,"Nxc6":309,"Bd4":310,"xb3":311,"Kc5":312,"Rac":313,"Ke8":314,"Bf6":315,"bxa":316,"Nd6":317,"Kc4":318,"Ra8":319,"Rd":320,"Nbd2":321,"Bg3":322,"Be5":323,"Bb6":324,"Ng6":325,"Ra1":326,"Bxc4":327,"Qd8":328,"Ne3":329,"Nh5":330,"Nxf6":331,"Be4":332,"Qc6":333,"Rf7":334,"dxc5":335,"Kxh":336,"Nd3":337,"Ne6":338,"Rad1":339,"Kd1":340,"xc8":341,"Qc5":342,"Rf2":343,"Re3":344,"Bh6":345,"Nh4":346,"Qc3":347,"Bh4":348,"Rxd8":349,"axb5":350,"xb6":351,"Ng3":352,"Rc7":353,"Qd1":354,"Kb6":355,"xc1":356,"e7":357,"Qc4":358,"Kh6":359,"a8":360,"xd6":361,"Qb4":362,"hxg5":363,"Kb8":364,"Ke1":365,"Bxe6":366,"Na5":367,"Rxd1":368,"Rc2":369,"Nxf3":370,"Kh3":371,"Kb1":372,"Nbd7":373,"Qb5":374,"Nxc3":375,"Bc6":376,"a1":377,"hxg4":378,"Bxc5":379,"Kb3":380,"Rd3":381,"fxe4":382,"Bh5":383,"Bg6":384,"Bf3":385,"gxf3":386,"gxf6":387,"Nb6":388,"Bxf4":389,"exf5":390,"Nh6":391,"Re6":392,"axb4":393,"Rd6":394,"Kb7":395,"Ba6":396,"Rh8":397,"Rf3":398,"Kb5":399,"exf4":400,"Bxg5":401,"Kb4":402,"Ra7":403,"Rfe1":404,"Bxf5":405,"Rad8":406,"fxe6":407,"Qxd6":408,"Rh1":409,"Rxe5":410,"Rxe8":411,"Bc3":412,"Kb2":413,"Re4":414,"h2":415,"Ba4":416,"Qf7":417,"Rab":418,"Rf6":419,"Qxb2":420,"Re5":421,"Qxg5":422,"Ra2":423,"Qxd3":424,"Qe8":425,"Nb3":426,"Rxe1":427,"Qe1":428,"Kh5":429,"h7":430,"Rd4":431,"Kh4":432,"Nxc4":433,"bxc4":434,"Bxd6":435,"e2":436,"Rd5":437,"Rxe4":438,"Qxe7":439,"Kc8":440,"Rb7":441,"Bxd7":442,"Na3":443,"Qxb7":444,"Qf2":445,"Na4":446,"Bxe7":447,"Qxc3":448,"Qxc6":449,"exf6":450,"dxc6":451,"Qh3":452,"Na6":453,"Rb2":454,"Qxg4":455,"Rxf7":456,"xe8":457,"Rg3":458,"xe1":459,"bxc5":460,"Rfe8":461,"Rf4":462,"Qxf7":463,"Bxf7":464,"Rf5":465,"Bxg4":466,"Bc2":467,"Bxe3":468,"Bh3":469,"Ba3":470,"Qxd7":471,"Rc6":472,"Qc8":473,"Nh3":474,"Nc7":475,"Rc3":476,"Bxb5":477,"Kc1":478,"Ra3":479,"Qh6":480,"Nxf7":481,"Rxd5":482,"Qxe6":483,"Rxf2":484,"Rxd4":485,"Qxc4":486,"Rg6":487,"Ra6":488,"fxe3":489,"Rb6":490,"Rc4":491,"Bxd3":492,"Rg7":493,"Nxe6":494,"gxf5":495,"Bxh6":496,"Rb3":497,"Rc5":498,"Qc1":499,"Qxc5":500,"xd3":501,"Rxb2":502,"Nxc5":503,"Bxd2":504,"Ba5":505,"f8":506,"Qxd8":507,"Qb7":508,"Rh7":509,"Nc2":510,"Qxe2":511,"Rg2":512,"Rxe6":513,"Nxg5":514,"Rh3":515,"Rxb7":516,"cxb5":517,"Kxf7":518,"Qxf4":519,"Qg7":520,"Bxb4":521,"hxg6":522,"Kxa":523,"Rac1":524,"Ra4":525,"Rg4":526,"Ra5":527,"Qxf2":528,"Rae1":529,"f1":530,"cxb4":531,"Rac8":532,"Rh2":533,"Rxd6":534,"Nxd6":535,"Rxa2":536,"xg8":537,"Rg5":538,"c8":539,"Qxd2":540,"Rxa7":541,"Nxd7":542,"Nxe3":543,"Nxg4":544,"Rh6":545,"Nf7":546,"gxf4":547,"Qxe3":548,"c1":549,"Qxd1":550,"Bxe2":551,"Rxf6":552,"Rb4":553,"Qxf5":554,"Rh4":555,"Nxf4":556,"Qb2":557,"dxc3":558,"Rxf8":559,"Nxf5":560,"Nxd3":561,"Qxg7":562,"Qg2":563,"Rh5":564,"Rxe7":565,"Rxf3":566,"Qxg2":567,"Rb5":568,"Qxc2":569,"Rxf4":570,"Nxb5":571,"Rxc2":572,"Nxb":573,"Rae8":574,"Qxc7":575,"Rxc7":576,"Bxf2":577,"fxg5":578,"Rxd3":579,"Rxf5":580,"Rxe3":581,"Rxf1":582,"hxg3":583,"cxd6":584,"fxg6":585,"Nge7":586,"Nxe7":587,"axb3":588,"Qxb5":589,"fxg4":590,"Bc7":591,"Rxd7":592,"exd6":593,"Rxc3":594,"Rfd1":595,"Qxa2":596,"Nxc2":597,"Bxg7":598,"Qa3":599,"Bxh3":600,"Qxa7":601,"Nd":602,"Bxb2":603,"Qa6":604,"Nxd2":605,"Qf8":606,"Nxc7":607,"Rxc6":608,"Qxb4":609,"Nxb4":610,"Nf2":611,"Qxh7":612,"Qb8":613,"Rxc8":614,"Ka6":615,"Rxd2":616,"Rxc1":617,"Rxc4":618,"Qf1":619,"Rfd8":620,"Ka3":621,"Rxg7":622,"Rab1":623,"xg1":624,"Ka5":625,"Qxa8":626,"Bf8":627,"Nxf2":628,"Rxe2":629,"cxd3":630,"Rxc5":631,"Ka4":632,"fxg3":633,"Rxg2":634,"Bc8":635,"Kxf2":636,"Rxa6":637,"axb6":638,"Qb1":639,"Bxb7":640,"gxh5":641,"Qxh6":642,"Ka7":643,"gxh6":644,"Rxh7":645,"Qxg6":646,"Rab8":647,"Rxa4":648,"Rxa5":649,"Qxh5":650,"Qxh4":651,"Ka2":652,"Qxa1":653,"Kxg7":654,"Nxg6":655,"Bf2":656,"Rxa1":657,"Rxa8":658,"Kxd8":659,"c7":660,"Rxa3":661,"Bf7":662,"Bc1":663,"c2":664,"Nxe2":665,"Qxh2":666,"Bxa6":667,"exf3":668,"b1":669,"dxe6":670,"b8":671,"Qxh3":672,"Qh7":673,"Bxg2":674,"gxh4":675,"Bf1":676,"Rxh2":677,"gxh3":678,"Rxb5":679,"Rxg5":680,"Rxb4":681,"Nxg3":682,"Qa8":683,"bxa4":684,"Rxh6":685,"Qxg3":686,"Rxg4":687,"Bxc7":688,"Ba2":689,"Rxh5":690,"h8":691,"f7":692,"Nxb3":693,"Qh8":694,"b7":695,"Qa1":696,"Bxg6":697,"bxa5":698,"Nge2":699,"Nh2":700,"Rxh4":701,"b2":702,"Rxh3":703,"Bxf8":704,"f2":705,"Bxg3":706,"Rg":707,"Qh2":708,"Bxc2":709,"Bxa3":710,"Qh1":711,"h1":712,"Qxa6":713,"Qxe8":714,"Kxd1":715,"Qg8":716,"Qxe1":717,"Bxa8":718,"Rxg6":719,"Qa7":720,"Rxb3":721,"Qxh8":722,"Bxa1":723,"Ka8":724,"Qxb3":725,"Nxa8":726,"Bd8":727,"Ne8":728,"cxb3":729,"Nh7":730,"Rxb6":731,"Qxb6":732,"Bxd8":733,"Ka1":734,"Qxa5":735,"Qxa4":736,"Kxg2":737,"Nf1":738,"Rhe1":739,"Bxf1":740,"Qg1":741,"Rxg3":742,"Rxb8":743,"Rxb1":744,"Qxf8":745,"Bxd1":746,"Kxd7":747,"Nxa1":748,"Bd1":749,"Kxf8":750,"Nxd8":751,"Kxb":752,"Nxb6":753,"Qxa3":754,"Kxe7":755,"Qa2":756,"cxb6":757,"Kxf1":758,"Rhe8":759,"Ne1":760,"Be8":761,"Bxh4":762,"Nxh4":763,"bxa3":764,"Bxa7":765,"Nf8":766,"Kxf6":767,"bxa6":768,"Kxg5":769,"Nxh5":770,"Nxd1":771,"Kxe2":772,"Bxb6":773,"R1":774,"Kxg4":775,"Bxh7":776,"Qxf1":777,"Nxh8":778,"Bxb3":779,"Qxh1":780,"Nxf8":781,"Kxd2":782,"Kxf4":783,"Ba7":784,"Kxf5":785,"Kxf3":786,"Rfc8":787,"R8":788,"Bxa2":789,"Rxh8":790,"Nxb7":791,"Nb8":792,"Bxh5":793,"Be1":794,"Nxb2":795,"Bh2":796,"Rfc1":797,"Ngf6":798,"Qxc8":799,"Bxa4":800,"Rxg8":801,"Ng8":802,"Nd8":803,"Nxa7":804,"Nxh6":805,"exd3":806,"Kxe5":807,"Kxe6":808,"Qxc1":809,"Kxh7":810,"Nd1":811,"Bxh2":812,"Nb7":813,"Bb1":814,"Rxh1":815,"Ngf3":816,"Bxa5":817,"Kxh4":818,"Nxf1":819,"Kxh5":820,"Nxa2":821,"Nxa4":822,"Kxe4":823,"Bh7":824,"Kxg6":825,"dxe3":826,"Rde1":827,"Nb1":828,"Nxa5":829,"Nxg7":830,"Nxh7":831,"Bxh8":832,"Ng7":833,"Nxa6":834,"Kxg3":835,"Nxh3":836,"Nc8":837,"Rhf8":838,"Rhg8":839,"Kxh2":840,"Rxg1":841,"Nfd7":842,"Kxd5":843,"Kxe3":844,"Rhg1":845,"Rde8":846,"Kxc4":847,"Kxd6":848,"Nxc8":849,"Nb2":850,"Kxc5":851,"Kxd4":852,"Nxe1":853,"Nxe8":854,"Bxc1":855,"Rhf1":856,"Ng2":857,"Kxh6":858,"Nbc6":859,"Qxb8":860,"Kxh3":861,"Kxd3":862,"Bxc8":863,"Raf8":864,"Ng1":865,"Nc1":866,"Bxe1":867,"Nxa3":868,"Nxc1":869,"Raf1":870,"Nxg2":871,"Na7":872,"Nxh2":873,"Kxc6":874,"Kxb4":875,"Kxb5":876,"Kxc3":877,"Bxe8":878,"Qxb1":879,"cxb":880,"Bxh1":881,"Qxg8":882,"Bb8":883,"Kxc7":884,"Kxe8":885,"Nxh1":886,"Nce7":887,"Red1":888,"Kxe1":889,"Kxc2":890,"Rhd1":891,"Bxb8":892,"Na2":893,"Rhd8":894,"Ndf3":895,"Bxg8":896,"Kxa4":897,"xd7":898,"Kxa5":899,"Nbc3":900,"Raxd":901,"Bxb1":902,"Kxb7":903,"Nfd2":904,"xd2":905,"Rfb1":906,"Kxb2":907,"Kxb3":908,"Kxb6":909,"Qxg1":910,"Nh":911,"Rfb8":912,"Red8":913,"Ndf6":914,"Kxa3":915,"Kxa6":916,"Nce2":917,"Bg1":918,"Kxa2":919,"Rdf8":920,"Rcd1":921,"Rcd8":922,"Bg8":923,"Rdf1":924,"Kxa7":925,"Rdg1":926,"cxb2":927,"Na":928,"Rbd1":929,"R7":930,"Kxg8":931,"exf7":932,"Rbd8":933,"Rbc8":934,"Rdg8":935,"Rbc1":936,"R2":937,"Qd":938,"Nxb8":939,"Kxg1":940,"R6":941,"R4":942,"R3":943,"R5":944,"Bxg1":945,"fxg7":946,"Ba8":947,"Nxb1":948,"Nxg8":949,"Kxc8":950,"Raxd8":951,"Raxd1":952,"xd8":953,"xd1":954,"Nce4":955,"Bh8":956,"Nce5":957,"Ncxe5":958,"Rec1":959,"cxb7":960,"Kxh8":961,"Kxc1":962,"axb":963,"Qg":964,"Ba1":965,"N7":966,"Rag8":967,"Qa":968,"Nbxd2":969,"Nec6":970,"N2":971,"Rbe1":972,"Ngxe5":973,"Nxg1":974,"Rce8":975,"Rag1":976,"Rce1":977,"dxc7":978,"dxe7":979,"Kxh1":980,"fxg2":981,"Rbe8":982,"Ree1":983,"N5":984,"Nge4":985,"Nbxd7":986,"exf2":987,"Rec8":988,"Rhc8":989,"N4":990,"Rdd7":991,"Nbd5":992,"Rdd1":993,"Nfd5":994,"Nfxd4":995,"Ree7":996,"Ncxe4":997,"N8":998,"Nge5":999,"Bh1":1000,"Rfxf":1001,"Rdc1":1002,"Rdd2":1003,"Nfd4":1004,"Ree2":1005,"Nbd4":1006,"Rdd8":1007,"N1":1008,"Ndb5":1009,"Neg5":1010,"gxf7":1011,"Rhc1":1012,"Ree8":1013,"Nec3":1014,"Rdc8":1015,"Neg4":1016,"dxc2":1017,"hxg7":1018,"hxg2":1019,"Nde5":1020,"Kxb8":1021,"Raxc8":1022,"Nfxd5":1023,"N6":1024,"Kxa8":1025,"Nde4":1026,"N3":1027,"gxh7":1028,"Rfa1":1029,"Kxb1":1030,"exd7":1031,"Rdh1":1032,"gxf2":1033,"Raxc1":1034,"Ndxe5":1035,"Rfa8":1036,"Nh8":1037,"Kxa1":1038,"Reb1":1039,"Nbxd5":1040,"Rff1":1041,"Ref8":1042,"Ngxe4":1043,"Rgf8":1044,"Raa8":1045,"Raa1":1046,"Rff8":1047,"Rfxd1":1048,"Rcc7":1049,"Nfg5":1050,"Ref1":1051,"Rcc2":1052,"gxh2":1053,"Rgf1":1054,"Rcc8":1055,"Rfxd8":1056,"Rdh8":1057,"Na8":1058,"Nh1":1059,"Rff7":1060,"Rff2":1061,"Ned5":1062,"Rbb8":1063,"Nfe5":1064,"R1e2":1065,"Ned4":1066,"Rcc1":1067,"Rge1":1068,"Rge8":1069,"Rbb1":1070,"dxe2":1071,"fxe7":1072,"R1d2":1073,"Na1":1074,"Ndb4":1075,"Nde2":1076,"Nfe4":1077,"Rhb8":1078,"Ncd4":1079,"axb2":1080,"Ncd5":1081,"Nbxd4":1082,"Nhf6":1083,"Reb8":1084,"Raxa":1085,"R8d7":1086,"R8e7":1087,"axb7":1088,"Nef6":1089,"Nef3":1090,"Nfg4":1091,"cxd7":1092,"N2f3":1093,"bxa2":1094,"Rhb1":1095,"Ncxd4":1096,"Ned7":1097,"Ndxf":1098,"Nexd5":1099,"Rah8":1100,"Nhf3":1101,"Ncd7":1102,"N7f6":1103,"Ndxe4":1104,"Nexd4":1105,"bxc2":1106,"cxd2":1107,"bxa7":1108,"Rcf8":1109,"Ngxe2":1110,"Rhxf":1111,"Rah1":1112,"Ncd2":1113,"Ncb5":1114,"Rde2":1115,"exd2":1116,"Red2":1117,"Raxb":1118,"Rhxh":1119,"bxc7":1120,"Rbf8":1121,"R1f2":1122,"Rbb7":1123,"Rbf1":1124,"Rcf1":1125,"R8f7":1126,"Ngxe7":1127,"Ncb4":1128,"Rbb2":1129,"Rdb1":1130,"Rcb1":1131,"Ned2":1132,"Ree3":1133,"N8d7":1134,"Rfe2":1135,"xf7":1136,"Nfxe5":1137,"Rde7":1138,"Rcb8":1139,"Raa7":1140,"Nhf5":1141,"Nde7":1142,"Nfxe4":1143,"Red7":1144,"xf2":1145,"Rfe7":1146,"Rdb8":1147,"Ndc4":1148,"Rdd3":1149,"Nef5":1150,"Raa2":1151,"Rgd1":1152,"Rgd8":1153,"fxe2":1154,"xf6":1155,"xf5":1156,"Nhf4":1157,"Nfe7":1158,"Ndc5":1159,"xf4":1160,"Rbxb":1161,"Nac6":1162,"Ree6":1163,"Rfxf7":1164,"Rhg7":1165,"Nef4":1166,"Rhh8":1167,"Rdd6":1168,"xf3":1169,"Rfg8":1170,"Rhh1":1171,"Rfxf2":1172,"exf8":1173,"Rhg2":1174,"Rfg1":1175,"Rff3":1176,"Nac4":1177,"Rgg8":1178,"Rfd2":1179,"R8c7":1180,"N1d2":1181,"bxa8":1182,"Ndc6":1183,"Rgg7":1184,"Rgg1":1185,"Rgg2":1186,"Rcd2":1187,"Ref2":1188,"Rcd7":1189,"N1c3":1190,"Nac5":1191,"Rgf7":1192,"Q8":1193,"Ncxd5":1194,"Nec4":1195,"Ndf5":1196,"R1c2":1197,"Ref7":1198,"Reg8":1199,"Rfd7":1200,"Nec5":1201,"Rea1":1202,"R1e3":1203,"Nfe2":1204,"N8e7":1205,"Rff6":1206,"Q1":1207,"Reg1":1208,"bxa1":1209,"Rgf2":1210,"Rexd1":1211,"cxd8":1212,"Red3":1213,"exd8":1214,"R1d3":1215,"Nac3":1216,"Rdf2":1217,"Rdf7":1218,"Ndf4":1219,"gxf8":1220,"Rab7":1221,"Rfe3":1222,"dxe8":1223,"N7b6":1224,"Ncxe7":1225,"R1e6":1226,"Rab2":1227,"Ree4":1228,"Rde3":1229,"Nfxd2":1230,"Rdc7":1231,"Rce2":1232,"Rdc2":1233,"Ree5":1234,"Rbc7":1235,"Rhh7":1236,"N4f3":1237,"R1d6":1238,"cxd1":1239,"R1e7":1240,"Rce7":1241,"N7c6":1242,"Ngxf6":1243,"Ndc3":1244,"R8e6":1245,"Rcc3":1246,"R8d6":1247,"Rhh2":1248,"Rdd5":1249,"Rfe6":1250,"dxe1":1251,"Rexe7":1252,"N2b3":1253,"Rgf3":1254,"Nfxd7":1255,"axb8":1256,"Rec2":1257,"Raxb8":1258,"Rdd4":1259,"R8d3":1260,"exf1":1261,"Nce3":1262,"Rbc2":1263,"R7d6":1264,"axb1":1265,"N5f6":1266,"Rcg8":1267,"Ndxb5":1268,"R1d7":1269,"Red6":1270,"Rdxd7":1271,"Rec7":1272,"Nhg4":1273,"Rea8":1274,"Rcc6":1275,"R8g7":1276,"N7g6":1277,"Rde6":1278,"R8e2":1279,"gxf1":1280,"R7e6":1281,"Rhxf8":1282,"dxc8":1283,"R1g2":1284,"Raxb1":1285,"Ndxe7":1286,"R2d3":1287,"Rgf6":1288,"Rae7":1289,"R1f3":1290,"Rcxc2":1291,"xa7":1292,"Rae2":1293,"xb7":1294,"gxh8":1295,"Ngf5":1296,"N6d7":1297,"Nab5":1298,"N5c3":1299,"exd1":1300,"Rha8":1301,"Rcxc7":1302,"N4c6":1303,"Rac7":1304,"R8e3":1305,"Rad7":1306,"fxe8":1307,"Rbg8":1308,"Rff4":1309,"R2e3":1310,"R3e2":1311,"Rhg3":1312,"Raf7":1313,"xb2":1314,"Rgxg7":1315,"Rbd7":1316,"Nhg5":1317,"Rexd8":1318,"Rcg1":1319,"Rfg7":1320,"Rfg2":1321,"dxc1":1322,"Rgc8":1323,"Ned6":1324,"R8f6":1325,"xa2":1326,"Rbd2":1327,"Raf2":1328,"Rfd3":1329,"R8b7":1330,"Ref3":1331,"Rgxg2":1332,"Ned3":1333,"Nexg4":1334,"Nexd7":1335,"Rdxd2":1336,"Rexe6":1337,"Ngf4":1338,"N8c6":1339,"Ndxc4":1340,"Ncd6":1341,"Rhg6":1342,"Rff5":1343,"Rbe2":1344,"bxc8":1345,"Rfxe1":1346,"Rac2":1347,"Q4":1348,"Nab4":1349,"Rcf2":1350,"R8d2":1351,"xa4":1352,"N2g3":1353,"Nbd6":1354,"Nexg5":1355,"Nde3":1356,"Ncd3":1357,"xa6":1358,"xf8":1359,"Rad2":1360,"Rcd3":1361,"Rgh1":1362,"Ndxf6":1363,"Rgh8":1364,"Red4":1365,"Nce6":1366,"Rfc7":1367,"Rhxf1":1368,"Rfc2":1369,"Rbxb2":1370,"R1e5":1371,"Rexe5":1372,"bxc1":1373,"Rha1":1374,"N1e2":1375,"Nbd3":1376,"N2c3":1377,"R1d5":1378,"Nbxc6":1379,"Rde4":1380,"Rbxb7":1381,"cxb8":1382,"R1e4":1383,"Neg6":1384,"Q5":1385,"cxb1":1386,"Rbe7":1387,"Red5":1388,"xa5":1389,"R3f2":1390,"Rgc1":1391,"Rcf7":1392,"Rbg1":1393,"R3d2":1394,"Rfxe8":1395,"Nge6":1396,"Rdxd6":1397,"Nge3":1398,"Ndxe2":1399,"Rcd6":1400,"Rdxd5":1401,"hxg8":1402,"fxe1":1403,"Ncxe2":1404,"R1b2":1405,"Rdg2":1406,"Nde6":1407,"Raa3":1408,"Nbc5":1409,"Nfxg5":1410,"Rfxc1":1411,"xa3":1412,"Rcc4":1413,"Rexe4":1414,"Rbxc8":1415,"Raxa7":1416,"N1h2":1417,"R6e7":1418,"Rdg7":1419,"Rbb3":1420,"Rge3":1421,"Nbc4":1422,"Ncxb5":1423,"Rbb6":1424,"Rde5":1425,"Nac7":1426,"Nfe3":1427,"Rexe2":1428,"Rfg3":1429,"Rdxd4":1430,"hxg1":1431,"Rda1":1432,"Nfd6":1433,"R2f3":1434,"Rbxd8":1435,"Rge7":1436,"Raxa2":1437,"R1d4":1438,"gxh1":1439,"Rhf7":1440,"R1h7":1441,"R8e4":1442,"R8d4":1443,"Rdf3":1444,"Ref6":1445,"Rfd6":1446,"Rca1":1447,"Rfxc8":1448,"Rfe4":1449,"Rcc5":1450,"R6f7":1451,"Raa6":1452,"Raxe8":1453,"Neg3":1454,"Rgg3":1455,"Rca8":1456,"Rfe5":1457,"R7f6":1458,"Nfd3":1459,"Rbf2":1460,"Rbf7":1461,"R8e5":1462,"N5c6":1463,"Rdxd3":1464,"Q6":1465,"R8d5":1466,"Rfg6":1467,"Rhg5":1468,"Rfh8":1469,"Nexd2":1470,"Q3":1471,"Rcb7":1472,"fxg8":1473,"N3h4":1474,"R6d7":1475,"Rhxh7":1476,"Rda8":1477,"Rhf2":1478,"Rcxd8":1479,"Rba1":1480,"R8h7":1481,"Ngxf7":1482,"Rge2":1483,"Nbxc3":1484,"R8c3":1485,"xf1":1486,"Rexe3":1487,"Rgg6":1488,"Ndxf3":1489,"Rhg4":1490,"Rfxf6":1491,"Nac2":1492,"Rab6":1493,"R1h2":1494,"Rbxc1":1495,"Rag2":1496,"Nfxg4":1497,"Rhf3":1498,"R8a7":1499,"Ngxf3":1500,"Qbb2":1501,"R6d5":1502,"Rcb2":1503,"Rcg7":1504,"Rfh1":1505,"R4e3":1506,"Rbxd1":1507,"R1c6":1508,"Rgf5":1509,"R8h2":1510,"Rgf4":1511,"Rcg2":1512,"Rcxc3":1513,"Nfe6":1514,"Rfxf3":1515,"Rba8":1516,"Q2":1517,"Rhe7":1518,"Rce3":1519,"Qgg2":1520,"R2c3":1521,"R4f3":1522,"Ncb6":1523,"Rhh3":1524,"R8c6":1525,"R6e5":1526,"Rab3":1527,"xh7":1528,"Rdc3":1529,"Reh1":1530,"R7c6":1531,"Ndf1":1532,"Qbb7":1533,"Ndxc5":1534,"Rag7":1535,"Rdf6":1536,"Rbc6":1537,"Rhxh2":1538,"Rge6":1539,"Rcxc6":1540,"Rhh6":1541,"Ndxb4":1542,"Q7":1543,"Nexc6":1544,"Rec3":1545,"Rbc3":1546,"R1a2":1547,"Rhd2":1548,"Rhd7":1549,"Rcd4":1550,"R8f3":1551,"R1f6":1552,"R1f7":1553,"N5b6":1554,"N3d2":1555,"Nba6":1556,"R1c3":1557,"N5g6":1558,"Qgg7":1559,"Reg7":1560,"R4e2":1561,"Nfg6":1562,"Rcxd1":1563,"Ndf8":1564,"Rbg2":1565,"Rhf6":1566,"Rcd5":1567,"Rbg7":1568,"Nba3":1569,"Qdd2":1570,"N8f6":1571,"R5e4":1572,"xh2":1573,"Qdd7":1574,"R8f2":1575,"Reh8":1576,"Rce6":1577,"Ref4":1578,"Qff3":1579,"Qee7":1580,"Rhe2":1581,"Rdc6":1582,"Raxe1":1583,"Qee2":1584,"Rgd2":1585,"N6h5":1586,"R3d4":1587,"Rbd3":1588,"Reg3":1589,"Rhf4":1590,"Ngxe6":1591,"Rfxf4":1592,"Rgb8":1593,"Qcc7":1594,"Qff6":1595,"Qgg6":1596,"Rfxf5":1597,"Reb7":1598,"R3e4":1599,"Ref5":1600,"R5f6":1601,"Rfd4":1602,"R5e6":1603,"Nexc4":1604,"Nexc3":1605,"Rdb7":1606,"R1c7":1607,"Qff7":1608,"Qcc6":1609,"Rgd7":1610,"Reb2":1611,"N1f3":1612,"Ndb6":1613,"Qdd6":1614,"Rbb4":1615,"R4d3":1616,"xh4":1617,"Qcc3":1618,"Qcc2":1619,"Nbc7":1620,"xh5":1621,"Qff2":1622,"Qgg3":1623,"Qee3":1624,"Reg2":1625,"Rbd6":1626,"Rac6":1627,"Qee5":1628,"Rhf5":1629,"Ncxb4":1630,"Rdb2":1631,"Nhf7":1632,"Rac3":1633,"R8c2":1634,"Nfg3":1635,"Rgb1":1636,"R5e3":1637,"R7e5":1638,"Ndxf7":1639,"R5f7":1640,"Rbb5":1641,"Qbb3":1642,"Raa4":1643,"Rcxc4":1644,"Ngf7":1645,"Rch8":1646,"Qee6":1647,"Rgg4":1648,"R8f5":1649,"R4e5":1650,"R3f4":1651,"Qbb6":1652,"Rge4":1653,"N5e4":1654,"fxg1":1655,"Qdd4":1656,"R5d6":1657,"Qdd5":1658,"Rfb2":1659,"Rgg5":1660,"R5e2":1661,"N4b3":1662,"Rab4":1663,"Rcxc5":1664,"Naxc4":1665,"R5d4":1666,"N4c3":1667,"Rfd5":1668,"Qff4":1669,"R4f2":1670,"N3e4":1671,"Ncxe6":1672,"Qdd3":1673,"Nca6":1674,"Rfb7":1675,"Rec6":1676,"Rab5":1677,"R4d2":1678,"Rad6":1679,"N4e5":1680,"Qee4":1681,"Rge5":1682,"Rexd5":1683,"xh6":1684,"R5e7":1685,"Rbh8":1686,"Ndb3":1687,"Qdd8":1688,"Rfg4":1689,"Rgd3":1690,"Rbc4":1691,"Rgh3":1692,"R1h6":1693,"R7d5":1694,"Rdxe5":1695,"R2e4":1696,"N4g3":1697,"Rhh4":1698,"Rdc4":1699,"Rce5":1700,"Raxa6":1701,"R1a7":1702,"Rhe3":1703,"Qff5":1704,"Rdc5":1705,"R8h3":1706,"Rexd4":1707,"Rch1":1708,"Rce4":1709,"Raxa3":1710,"Qcc5":1711,"R8c4":1712,"Qee1":1713,"Qca2":1714,"Reg6":1715,"R1f4":1716,"Rbh1":1717,"R2g3":1718,"N4f6":1719,"Rdf4":1720,"Nexf5":1721,"Qca8":1722,"Qca7":1723,"R6f5":1724,"N6d5":1725,"Qgg4":1726,"Rfg5":1727,"xh3":1728,"Qdb7":1729,"Raa5":1730,"R8f4":1731,"R4d5":1732,"N5f3":1733,"Ncb3":1734,"Rgxg6":1735,"R5d7":1736,"Rdf5":1737,"Qgg8":1738,"Raxa4":1739,"Nhxf5":1740,"Qdb2":1741,"Qdb8":1742,"Ngh6":1743,"Naxc5":1744,"R7b6":1745,"Nexf7":1746,"Rdg3":1747,"Raxa5":1748,"Rgxg3":1749,"Rad3":1750,"Rbd4":1751,"Qbb8":1752,"Qff1":1753,"Rac5":1754,"Qcc4":1755,"Qdd1":1756,"Rhh5":1757,"R8g6":1758,"Rhxg8":1759,"Rae3":1760,"N5a3":1761,"Rdxe4":1762,"Qbb1":1763,"Rgh6":1764,"R6c7":1765,"Qbb4":1766,"R1b7":1767,"Ndxf2":1768,"Rcb6":1769,"Rbc5":1770,"Qca1":1771,"Qcc1":1772,"Qhh7":1773,"Rgh7":1774,"Qdb1":1775,"Qgg5":1776,"R4f5":1777,"Ndc7":1778,"N3d4":1779,"xb1":1780,"Rgh2":1781,"Qee8":1782,"Qff8":1783,"Rgh4":1784,"Rbxb3":1785,"N6e5":1786,"Ndb8":1787,"Nab6":1788,"Nbxd6":1789,"Rbxb4":1790,"Rdxe7":1791,"Nhg6":1792,"Qaa7":1793,"R8a2":1794,"R4f6":1795,"R5f4":1796,"Rhxh6":1797,"R7g6":1798,"Rgc7":1799,"Qcc8":1800,"R8b6":1801,"R2d4":1802,"Rac4":1803,"R1a6":1804,"R5d3":1805,"Neg8":1806,"R5d2":1807,"Nca3":1808,"Qgg1":1809,"R1b6":1810,"R6d4":1811,"R3c2":1812,"R4e6":1813,"Qaa2":1814,"N4a6":1815,"Nexc5":1816,"Qbb5":1817,"Rexd7":1818,"N4d5":1819,"Rbd5":1820,"R1f5":1821,"Nec7":1822,"Qhh2":1823,"Rgh5":1824,"Rhxh3":1825,"R8c5":1826,"Ndf7":1827,"Rfc3":1828,"Rhe6":1829,"Rgxg5":1830,"Rae6":1831,"Rcb3":1832,"R1c5":1833,"R2b3":1834,"Rhe4":1835,"Rbe3":1836,"N7d5":1837,"N2e4":1838,"R3c4":1839,"Rfh3":1840,"Rbxb6":1841,"Rec4":1842,"R1b3":1843,"Ngxf2":1844,"Rdxf7":1845,"Rdxf2":1846,"Nfxd6":1847,"R1g3":1848,"R7e2":1849,"Rdxe6":1850,"Nhf2":1851,"R6g7":1852,"Ncxe3":1853,"Rgc2":1854,"Nef7":1855,"Rcxf2":1856,"Nab3":1857,"Nexf4":1858,"Rba7":1859,"Rhc2":1860,"Rec5":1861,"R5f3":1862,"Rexd6":1863,"R8a3":1864,"R6c5":1865,"R3g2":1866,"R8b3":1867,"R8b2":1868,"Qaa1":1869,"Qec7":1870,"Nhg3":1871,"Qfh8":1872,"Rgxg4":1873,"Nhxf4":1874,"Qaa3":1875,"Rcf3":1876,"Reg4":1877,"Nbc2":1878,"R7d2":1879,"Reg5":1880,"Rhd3":1881,"xb8":1882,"Neg1":1883,"Rbe6":1884,"Qaa6":1885,"Rexd2":1886,"R6d2":1887,"Rhc7":1888,"R7e3":1889,"Qec2":1890,"R1c4":1891,"Qec8":1892,"R4e7":1893,"N5d4":1894,"R6d3":1895,"Rdb3":1896,"Rbxb5":1897,"Qfh7":1898,"Qeg8":1899,"Rfxe7":1900,"Rhe5":1901,"R2h3":1902,"Rdh2":1903,"R4f7":1904,"Nexf6":1905,"N6e7":1906,"Qeg7":1907,"N7e5":1908,"Rba2":1909,"Qhh6":1910,"Qfh1":1911,"Rgd6":1912,"R6e4":1913,"R7e4":1914,"Rgd4":1915,"Rfh5":1916,"Nef2":1917,"Rad4":1918,"Rad5":1919,"Rdxe3":1920,"R8g2":1921,"Qaa8":1922,"Rhxh5":1923,"Ngh3":1924,"Ngf2":1925,"Rhxh4":1926,"R7a6":1927,"Rfh6":1928,"Rdb6":1929,"Rca7":1930,"Rhxd8":1931,"Ndc2":1932,"R7h6":1933,"R2c4":1934,"Rexd3":1935,"Qaa5":1936,"Ndxf4":1937,"Nfh4":1938,"Qeg2":1939,"Qhh3":1940,"Rdg6":1941,"Qfh2":1942,"Rcb5":1943,"R4d6":1944,"Rfh4":1945,"Qhf6":1946,"Ndxe6":1947,"Rgd5":1948,"R4d7":1949,"N2d4":1950,"Ncxd6":1951,"R2e7":1952,"Rhxg1":1953,"Rexf7":1954,"Ncb8":1955,"Nexf2":1956,"N8h7":1957,"Rcb4":1958,"Qeg1":1959,"Nexd6":1960,"Qhh5":1961,"Nbxd3":1962,"R2e6":1963,"R2f4":1964,"Rhd6":1965,"Ndxf5":1966,"Ndf2":1967,"Ndb1":1968,"R3d5":1969,"Nhf1":1970,"Qaa4":1971,"Rfxe6":1972,"Rcxd7":1973,"R7d4":1974,"R2e5":1975,"Rfc6":1976,"R6f4":1977,"R6e2":1978,"Rfxe4":1979,"Rcf6":1980,"R3b2":1981,"Ngf8":1982,"Nfg8":1983,"Nce8":1984,"Rca2":1985,"R1g6":1986,"Rexf2":1987,"Qec1":1988,"R8g3":1989,"Rfxe5":1990,"Rda7":1991,"Rdxe2":1992,"R6f3":1993,"Qad4":1994,"Rae4":1995,"Rba3":1996,"Rcxd4":1997,"Reb3":1998,"Qfd1":1999}